7b4software/stm32f2xx-hal/src/gpio.rs
//! General Purpose Input / Output

use core::marker::PhantomData;

use crate::pac::{EXTI, SYSCFG};

/// Extension trait to split a GPIO peripheral in independent pins and registers
pub trait GpioExt {
    /// The parts to split the GPIO into
    type Parts;

    /// Splits the GPIO block into independent pins and registers
    fn split(self) -> Self::Parts;
}

pub struct AF0;
pub struct AF1;
pub struct AF2;
pub struct AF3;
pub struct AF4;
pub struct AF5;
pub struct AF6;
pub struct AF7;
pub struct AF8;
pub struct AF9;
pub struct AF10;
pub struct AF11;
pub struct AF12;
pub struct AF13;
pub struct AF14;
pub struct AF15;

/// Some alternate mode (type state)
pub struct Alternate<MODE> {
    _mode: PhantomData<MODE>,
}

/// Some alternate mode in open drain configuration (type state)
pub struct AlternateOD<MODE> {
    _mode: PhantomData<MODE>,
}

/// Input mode (type state)
pub struct Input<MODE> {
    _mode: PhantomData<MODE>,
}

/// Floating input (type state)
pub struct Floating;

/// Pulled down input (type state)
pub struct PullDown;

/// Pulled up input (type state)
pub struct PullUp;

/// Open drain input or output (type state)
pub struct OpenDrain;

/// Output mode (type state)
pub struct Output<MODE> {
    _mode: PhantomData<MODE>,
}

/// Push pull output (type state)
pub struct PushPull;

/// Analog mode (type state)
pub struct Analog;

/// GPIO Pin speed selection
pub enum Speed {
    Low = 0,
    Medium = 1,
    High = 2,
    VeryHigh = 3,
}

#[derive(Debug, PartialEq)]
pub enum Edge {
    RISING,
    FALLING,
    RISING_FALLING,
}

/// External Interrupt Pin
pub trait ExtiPin {
    fn make_interrupt_source(&mut self, syscfg: &mut SYSCFG);
    fn trigger_on_edge(&mut self, exti: &mut EXTI, level: Edge);
    fn enable_interrupt(&mut self, exti: &mut EXTI);
    fn disable_interrupt(&mut self, exti: &mut EXTI);
    fn clear_interrupt_pending_bit(&mut self);
    fn check_interrupt(&self) -> bool;
}

macro_rules! exti_erased {
    ($PIN:ty, $extigpionr:expr) => {
        impl<MODE> ExtiPin for $PIN {
            /// Make corresponding EXTI line sensitive to this pin
            fn make_interrupt_source(&mut self, syscfg: &mut SYSCFG) {
                let offset = 4 * (self.i % 4);
                match self.i {
                    0..=3 => {
                        syscfg.exticr1.modify(|r, w| unsafe {
                            w.bits((r.bits() & !(0xf << offset)) | ($extigpionr << offset))
                        });
                    }
                    4..=7 => {
                        syscfg.exticr2.modify(|r, w| unsafe {
                            w.bits((r.bits() & !(0xf << offset)) | ($extigpionr << offset))
                        });
                    }
                    8..=11 => {
                        syscfg.exticr3.modify(|r, w| unsafe {
                            w.bits((r.bits() & !(0xf << offset)) | ($extigpionr << offset))
                        });
                    }
                    12..=15 => {
                        syscfg.exticr4.modify(|r, w| unsafe {
                            w.bits((r.bits() & !(0xf << offset)) | ($extigpionr << offset))
                        });
                    }
                    _ => {}
                }
            }

            /// Generate interrupt on rising edge, falling edge or both
            fn trigger_on_edge(&mut self, exti: &mut EXTI, edge: Edge) {
                match edge {
                    Edge::RISING => {
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << self.i)) });
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << self.i)) });
                    }
                    Edge::FALLING => {
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << self.i)) });
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << self.i)) });
                    }
                    Edge::RISING_FALLING => {
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << self.i)) });
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << self.i)) });
                    }
                }
            }

            /// Enable external interrupts from this pin.
            fn enable_interrupt(&mut self, exti: &mut EXTI) {
                exti.imr
                    .modify(|r, w| unsafe { w.bits(r.bits() | (1 << self.i)) });
            }

            /// Disable external interrupts from this pin
            fn disable_interrupt(&mut self, exti: &mut EXTI) {
                exti.imr
                    .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << self.i)) });
            }

            /// Clear the interrupt pending bit for this pin
            fn clear_interrupt_pending_bit(&mut self) {
                unsafe { (*EXTI::ptr()).pr.write(|w| w.bits(1 << self.i)) };
            }

            /// Reads the interrupt pending bit for this pin
            fn check_interrupt(&self) -> bool {
                unsafe { ((*EXTI::ptr()).pr.read().bits() & (1 << self.i)) != 0 }
            }
        }
    };
}

macro_rules! exti {
    ($PIN:ty, $extigpionr:expr, $i:expr, $exticri:ident) => {
        impl<MODE> ExtiPin for $PIN {
            /// Configure EXTI Line $i to trigger from this pin.
            fn make_interrupt_source(&mut self, syscfg: &mut SYSCFG) {
                let offset = 4 * ($i % 4);
                syscfg.$exticri.modify(|r, w| unsafe {
                    let mut exticr = r.bits();
                    exticr = (exticr & !(0xf << offset)) | ($extigpionr << offset);
                    w.bits(exticr)
                });
            }

            /// Generate interrupt on rising edge, falling edge or both
            fn trigger_on_edge(&mut self, exti: &mut EXTI, edge: Edge) {
                match edge {
                    Edge::RISING => {
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << $i)) });
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << $i)) });
                    }
                    Edge::FALLING => {
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << $i)) });
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << $i)) });
                    }
                    Edge::RISING_FALLING => {
                        exti.rtsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << $i)) });
                        exti.ftsr
                            .modify(|r, w| unsafe { w.bits(r.bits() | (1 << $i)) });
                    }
                }
            }

            /// Enable external interrupts from this pin.
            fn enable_interrupt(&mut self, exti: &mut EXTI) {
                exti.imr
                    .modify(|r, w| unsafe { w.bits(r.bits() | (1 << $i)) });
            }

            /// Disable external interrupts from this pin
            fn disable_interrupt(&mut self, exti: &mut EXTI) {
                exti.imr
                    .modify(|r, w| unsafe { w.bits(r.bits() & !(1 << $i)) });
            }

            /// Clear the interrupt pending bit for this pin
            fn clear_interrupt_pending_bit(&mut self) {
                unsafe { (*EXTI::ptr()).pr.write(|w| w.bits(1 << $i)) };
            }

