7b4software/stm32f2xx-hal/src/gpio.rs
                    /// Configures the pin to operate in AF3 mode
                    pub fn into_alternate_af3(self) -> $PXi<Alternate<AF3>> {
                        _set_alternate_mode($i, 3);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF4 mode
                    pub fn into_alternate_af4(self) -> $PXi<Alternate<AF4>> {
                        _set_alternate_mode($i, 4);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF5 mode
                    pub fn into_alternate_af5(self) -> $PXi<Alternate<AF5>> {
                        _set_alternate_mode($i, 5);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF6 mode
                    pub fn into_alternate_af6(self) -> $PXi<Alternate<AF6>> {
                        _set_alternate_mode($i, 6);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF7 mode
                    pub fn into_alternate_af7(self) -> $PXi<Alternate<AF7>> {
                        _set_alternate_mode($i, 7);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF8 mode
                    pub fn into_alternate_af8(self) -> $PXi<Alternate<AF8>> {
                        _set_alternate_mode($i, 8);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF9 mode
                    pub fn into_alternate_af9(self) -> $PXi<Alternate<AF9>> {
                        _set_alternate_mode($i, 9);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF10 mode
                    pub fn into_alternate_af10(self) -> $PXi<Alternate<AF10>> {
                        _set_alternate_mode($i, 10);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF11 mode
                    pub fn into_alternate_af11(self) -> $PXi<Alternate<AF11>> {
                        _set_alternate_mode($i, 11);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF12 mode
                    pub fn into_alternate_af12(self) -> $PXi<Alternate<AF12>> {
                        _set_alternate_mode($i, 12);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF13 mode
                    pub fn into_alternate_af13(self) -> $PXi<Alternate<AF13>> {
                        _set_alternate_mode($i, 13);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF14 mode
                    pub fn into_alternate_af14(self) -> $PXi<Alternate<AF14>> {
                        _set_alternate_mode($i, 14);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF15 mode
                    pub fn into_alternate_af15(self) -> $PXi<Alternate<AF15>> {
                        _set_alternate_mode($i, 15);
                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF0 open drain mode
                    pub fn into_alternate_af0_open_drain(self) -> $PXi<AlternateOD<AF0>> {
                        _set_alternate_mode($i, 0);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF1 open drain mode
                    pub fn into_alternate_af1_open_drain(self) -> $PXi<AlternateOD<AF1>> {
                        _set_alternate_mode($i, 1);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF2 open drain mode
                    pub fn into_alternate_af2_open_drain(self) -> $PXi<AlternateOD<AF2>> {
                        _set_alternate_mode($i, 2);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF3 open drain mode
                    pub fn into_alternate_af3_open_drain(self) -> $PXi<AlternateOD<AF3>> {
                        _set_alternate_mode($i, 3);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF4 open drain mode
                    pub fn into_alternate_af4_open_drain(self) -> $PXi<AlternateOD<AF4>> {
                        _set_alternate_mode($i, 4);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF5 open drain mode
                    pub fn into_alternate_af5_open_drain(self) -> $PXi<AlternateOD<AF5>> {
                        _set_alternate_mode($i, 5);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF6 open drain mode
                    pub fn into_alternate_af6_open_drain(self) -> $PXi<AlternateOD<AF6>> {
                        _set_alternate_mode($i, 6);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF7 open drain mode
                    pub fn into_alternate_af7_open_drain(self) -> $PXi<AlternateOD<AF7>> {
                        _set_alternate_mode($i, 7);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF8 open drain mode
                    pub fn into_alternate_af8_open_drain(self) -> $PXi<AlternateOD<AF8>> {
                        _set_alternate_mode($i, 8);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

                    /// Configures the pin to operate in AF9 open drain mode
                    pub fn into_alternate_af9_open_drain(self) -> $PXi<AlternateOD<AF9>> {
                        _set_alternate_mode($i, 9);
                        $PXi { _mode: PhantomData }.set_open_drain()
                    }

